In [2]:
import pandas as pd
import numpy as np

Our dataset is from: [https://www.kaggle.com/datasets/jackogozaly/data\-science\-and\-stem\-salaries?datasetId=1640011&sortBy=voteCount](https://www.kaggle.com/datasets/jackogozaly/data-science-and-stem-salaries?datasetId=1640011&sortBy=voteCount)

In [35]:
df = pd.read_csv("Levels_Fyi_Salary_Data.csv")

In [34]:
df.head()

,timestamp,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,...,Masters_Degree,Bachelors_Degree,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic
0,6/7/2017 11:33:27,Oracle,Product Manager,127000,"Redwood City, CA",1.5,1.5,107000.0,20000.0,10000.0,...,0,0,0,0,0,0,0,0,0,0
1,6/10/2017 17:11:29,eBay,Software Engineer,100000,"San Francisco, CA",5.0,3.0,0.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0
2,6/11/2017 14:53:57,Amazon,Product Manager,310000,"Seattle, WA",8.0,0.0,155000.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0
3,6/17/2017 0:23:14,Apple,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,157000.0,180000.0,35000.0,...,0,0,0,0,0,0,0,0,0,0
4,6/20/2017 10:58:51,Microsoft,Software Engineer,157000,"Mountain View, CA",5.0,3.0,0.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0

In [19]:
df['company'].isnull().values.any() #tells us if there are missing values in this column

True

In [20]:
df['company'].isnull().sum() #tells us how many null values are in a specific column

5

In [47]:
missing_cols = []
for col in df.columns:
    if df[col].isnull().values.any(): 
        num = df[col].isnull().sum()
    missing_cols.append([col, num])

NameError: name 'num' is not defined

In [10]:
df['Race'].notnull().sum()

22427

In [12]:
df['level'].value_counts()

L4                             5014
L5                             4871
L3                             3337
L6                             2871
Senior Software Engineer       1443
                               ...
Mid Market                        1
Gr 7                              1
Senior BA                         1
Consulting Analyst                1
Bioinformatics Scientist II       1
Name: level, Length: 2923, dtype: int64

In [24]:
df.columns

Index(['timestamp', 'company', 'level', 'title', 'totalyearlycompensation',
       'location', 'yearsofexperience', 'yearsatcompany', 'tag', 'basesalary',
       'stockgrantvalue', 'bonus', 'gender', 'otherdetails', 'cityid', 'dmaid',
       'rowNumber', 'Masters_Degree', 'Bachelors_Degree', 'Doctorate_Degree',
       'Highschool', 'Some_College', 'Race_Asian', 'Race_White',
       'Race_Two_Or_More', 'Race_Black', 'Race_Hispanic', 'Race', 'Education'],
      dtype='object')

In [36]:
df = df.drop(['Race'], axis = 1)

In [37]:
df = df.drop(['Education'], axis = 1)

In [38]:
df = df.drop(['otherdetails'], axis = 1)

In [0]:
df = df.drop(['level'], axis = 1)

In [39]:
df = df.drop(['tag'], axis = 1)

In [40]:
df = df.drop(['dmaid'], axis = 1)

In [45]:
df.dropna(inplace=True)
df.reset_index(drop=True, inplace = True)

In [46]:
df.columns

Index(['timestamp', 'company', 'level', 'title', 'totalyearlycompensation',
       'location', 'yearsofexperience', 'yearsatcompany', 'basesalary',
       'stockgrantvalue', 'bonus', 'gender', 'cityid', 'rowNumber',
       'Masters_Degree', 'Bachelors_Degree', 'Doctorate_Degree', 'Highschool',
       'Some_College', 'Race_Asian', 'Race_White', 'Race_Two_Or_More',
       'Race_Black', 'Race_Hispanic'],
      dtype='object')

In [49]:
#what is the largest base salary
max(df['basesalary'])

1620000.0

In [52]:
#look through bonus
df['bonus']

0        10000.0
1            0.0
2        25000.0
3        12000.0
4        50000.0
          ...
43023    18500.0
43024    56250.0
43025    30000.0
43026    20000.0
43027    19000.0
Name: bonus, Length: 43028, dtype: float64

In [0]:
#find which company is more popular